[{"id":"a49de3d7-c501-4bb2-ba00-f85cd99d44e3","image":"dwa","title":"Overnight Oats","name":"James De Jesus","favorites":false,"description":"If you’ve never had overnight oatmeal, they’re basically a no-cook method of making oatmeal. So, instead of cooking oatmeal on the stovetop or in the microwave, you soak the raw oats with milk. That soaking process allows the oats to absorb the liquid and soften them enough to eat uncooked. You only need to let the oats soak and rest in the fridge for 2 hours. But, it’s ideal if you soak it overnight…hence the name overnight oats!","ingredients":"Whole rolled oats – Also known as old fashioned oats. Quick oats and steel-cut oats will NOT work here. Quick oats will be too mushy, while steel-cut oats will be chewy and tough.\nChia seeds – For extra protein and the perfect thick and creamy texture.\nAlmond milk – Or any milk you like! Dairy milk and oat milk both work well. Coconut milk adds rich flavor and yields an especially creamy texture.\nMaple syrup – For sweetness. Honey works too.\nAnd a pinch of salt – To make the oats extra-flavorful.","instructions":"My method for how to make overnight oats is super simple! Here’s how it goes:\n\nPlace the oats, chia seeds, maple syrup or honey, salt, and yogurt, if using, in a lidded container or jar.\nPour in the almond milk, and stir thoroughly to combine. Make sure that there are no chia seeds clumped around the bottom or sides of the jar!\nCover and store overnight, or for up to 5 days, in the fridge.\nWhen you’re ready to eat, give the oats another stir, add your desired toppings, and enjoy!","date_added":1740921196451,"email_address":"jamesdejesus74@gmail.com"},{"id":"5421f8bc-974e-47ba-9260-32f64c24ae27","image":"dwa","title":"Blueberry Cheesecake","name":"James De Jesus","favorites":true,"description":"This blueberry cheesecake can be made any time of the year, thanks to frozen blueberries.\n\n","ingredients":"1 cup graham cracker crumbs\n\n¼ cup melted butter\n\n2 tablespoons white sugar\n\n2 (8 ounce) packages cream cheese, softened\n\n1 cup sour cream\n\n¾ cup white sugar\n\n2 tablespoons all-purpose flour\n\n1 teaspoon vanilla extract\n\n4 large eggs\n\n2 cups frozen blueberries, dry pack\n\n⅓ cup blueberry jelly","instructions":"Preheat the oven to 325 degree F (165 degrees C).\n\nMix graham crumbs, melted butter, and 2 tablespoons sugar in a bowl until well combined. Pat mixture into the bottom of a 9-inch springform pan.\n\nMash cream cheese in a mixing bowl until soft and creamy. Gradually beat in sour cream, 3/4 cup sugar, flour, and vanilla. Beat in eggs, one at a time. Pour mixture into the crumb-lined pan.\n\nBake in the preheated oven until firm to the touch, about 1 hour.\n\nPlace baked cheesecake in the refrigerator until thoroughly chilled, about 4 hours.\n\nRemove cheesecake from the pan by loosening the edges with a knife and opening the springform latch. Transfer to a serving platter. Place frozen blueberries on top. Melt jelly in a saucepan over low heat; spoon over blueberries to glaze. Chill in the refrigerator until ready to serve.","date_added":1740923755506,"email_address":"jamesdejesus74@gmail.com"}]