[{"id":"a49de3d7-c501-4bb2-ba00-f85cd99d44e3","image":"dwa","title":"Overnight Oats","name":"James De Jesus Oats","favorites":true,"description":"If you’ve never had overnight oatmeal, they’re basically a no-cook method of making oatmeal. So, instead of cooking oatmeal on the stovetop or in the microwave, you soak the raw oats with milk. That soaking process allows the oats to absorb the liquid and soften them enough to eat uncooked. You only need to let the oats soak and rest in the fridge for 2 hours. But, it’s ideal if you soak it overnight…hence the name overnight oats!","ingredients":"Whole rolled oats – Also known as old fashioned oats. Quick oats and steel-cut oats will NOT work here. Quick oats will be too mushy, while steel-cut oats will be chewy and tough.\nChia seeds – For extra protein and the perfect thick and creamy texture.\nAlmond milk – Or any milk you like! Dairy milk and oat milk both work well. Coconut milk adds rich flavor and yields an especially creamy texture.\nMaple syrup – For sweetness. Honey works too.\nAnd a pinch of salt – To make the oats extra-flavorful.","instructions":"My method for how to make overnight oats is super simple! Here’s how it goes:\n\nPlace the oats, chia seeds, maple syrup or honey, salt, and yogurt, if using, in a lidded container or jar.\nPour in the almond milk, and stir thoroughly to combine. Make sure that there are no chia seeds clumped around the bottom or sides of the jar!\nCover and store overnight, or for up to 5 days, in the fridge.\nWhen you’re ready to eat, give the oats another stir, add your desired toppings, and enjoy!","date_added":1740921196451,"email_address":"jamesdejesus74@gmail.com"},{"id":"b530d31c-32aa-46a5-b60b-a8e7b66f5194","image":"dwa","title":"Easy Fluffy Pancakes","name":"Ana Marie Querol","favorites":false,"description":"This easy pancake recipe with baking powder is my secret to the best light and fluffy pancakes. The perfect amount of baking powder reacts with the heat of the skillet, making the pancakes rise tall and fluffy.\n\nTrust me, you’ll never go back to boxed pancake mix again! Everything you need to whip up these delicious homemade pancakes is probably in your kitchen right now. To use buttermilk, try our buttermilk pancakes recipe.","ingredients":"Flour: I use all-purpose flour for these pancakes, but whole wheat, spelt, or even your favorite gluten-free flour blend will work in this recipe (or see my gluten free buckwheat pancakes). I often use a 50:50 blend of whole wheat and all-purpose flour and love them. See my whole wheat pancakes for more tips.\nSugar: I don’t like really sweet pancakes, so we add just enough sugar to the batter to ensure they taste great, but we don’t go overboard.\nBaking powder: Keeps our pancakes light and fluffy. Use recently purchased double-acting baking powder (it lasts about 3 months). If you are sensitive to the flavor of baking powder, make sure that yours is aluminum-free. If you only have baking soda, check the tips below the recipe for a substitution.\nMilk or non-dairy milk: Both work for this recipe, so use what you have. I’ve successfully made dairy-free pancakes with oat milk, almond milk, and coconut milk (carton, not canned).\nEgg: Adds structure and flavor, but you can make these pancakes without eggs (use a flax egg or see this vegan pancake recipe instead).\nButter: You can’t beat the taste of butter when making pancakes. Use unsalted or salted butter. For salted butter, omit the salt in our pancake recipe.\nVanilla: Adds a soft, sweet flavor. I always add a splash of vanilla to pancake batter (even when someone tells me not to).","instructions":"These easy pancakes come together quickly! So many of our readers love this pancake recipe and have even made it with their kids. Sometimes, the kids even make them on their own!\n\nTo make pancakes, you’ll whisk the flour, baking powder, and salt in a large bowl. Then, whisk melted butter, milk, egg, and vanilla in another. Stir the wet ingredients into the flour. As you stir, the batter will start to thicken and get bubbly (that’s the baking powder beginning to work its magic!). Be careful not to mix too much, or your pancakes won’t be as fluffy. We want to keep those bubbles.\n\nTo cook your pancakes, heat a skillet or flat griddle to medium heat, melt some butter, and add your batter. The butter gives them amazing crispy edges! You can use a 1/4 cup measure or a large cookie scoop to scoop the pancake batter into your skillet.\n\nFlip the pancakes when the edges look dry, and bubbles appear and pop on the top surfaces. They’ll need 1 to 2 minutes on each side. If you notice them browning too quickly, reduce the heat a little (I stay around medium heat).\n\nHere’s a photo of a cooked pancake. Look at how fluffy it is in the middle! These pancakes turn out so thick and fluffy (and remember, it’s all thanks to that baking powder).\n\nOur family loves fresh fruit with our pancakes. A simple fruit salad is nice, too. For something savory, bacon or sausage is a classic choice. Here’s our favorite way to cook bacon for perfect results. Eggs are also a fantastic pairing. Try our method for creamy scrambled eggs or perfect poached eggs.","date_added":1740926783378,"email_address":"ana@gmail.com"},{"id":"41970314-e5d9-46c1-9364-b0889af14f07","image":"dwa","title":"Blueberry Cheesecake","name":"James De Jesus","favorites":true,"description":"This blueberry cheesecake can be made any time of the year, thanks to frozen blueberries.\n","ingredients":"1 cup graham cracker crumbs\n\n¼ cup melted butter\n\n2 tablespoons white sugar\n\n2 (8 ounce) packages cream cheese, softened\n\n1 cup sour cream\n\n¾ cup white sugar\n\n2 tablespoons all-purpose flour\n\n1 teaspoon vanilla extract\n\n4 large eggs\n\n2 cups frozen blueberries, dry pack\n\n⅓ cup blueberry jelly","instructions":"Preheat the oven to 325 degree F (165 degrees C).\n\nMix graham crumbs, melted butter, and 2 tablespoons sugar in a bowl until well combined. Pat mixture into the bottom of a 9-inch springform pan.\n\nMash cream cheese in a mixing bowl until soft and creamy. Gradually beat in sour cream, 3/4 cup sugar, flour, and vanilla. Beat in eggs, one at a time. Pour mixture into the crumb-lined pan.\n\nBake in the preheated oven until firm to the touch, about 1 hour.\n\nPlace baked cheesecake in the refrigerator until thoroughly chilled, about 4 hours.\n\nRemove cheesecake from the pan by loosening the edges with a knife and opening the springform latch. Transfer to a serving platter. Place frozen blueberries on top. Melt jelly in a saucepan over low heat; spoon over blueberries to glaze. Chill in the refrigerator until ready to serve.","date_added":1740927254294,"email_address":"jamesdejesus74@gmail.com"}]